XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_lptim16.h
/**
  *******************************************************************************************************
  * @file    fm33fr0xx_fl_lptim16.h
  * @author  FMSH Application Team
  * @brief   Head file of LPTIM16 FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FR0XX_FL_LPTIM16_H
#define __FM33FR0XX_FL_LPTIM16_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lf0xx_fl_def.h"
/** @addtogroup FM33FR0XX_FL_Driver
  * @{
  */

/** @defgroup LPTIM16 LPTIM16
  * @brief LPTIM16 FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup LPTIM16_FL_ES_INIT LPTIM16 Exported Init structures
  * @{
  */

/**
  * @brief FL LPTIM16 Init Sturcture definition
  */

/**
  * @brief LPTIM16 Init Sturcture Definition
  */
typedef struct
{
    /* 内部时钟源 */
    uint32_t clockSource;

    /* 预分频器的时钟源 可选择内部时钟, 也可选择外部时钟 */
    uint32_t prescalerClockSource;

    /* 预分频系数 */
    uint32_t prescaler;

    /* 重装值 */
    uint32_t autoReload;

    /* 定时器工作模式选择 */
    uint32_t mode;

    /* 定时器编码器模式 */
    uint32_t encoderMode;

    /* 单次计数使能 */
    uint32_t onePulseMode;

    /* ETR异步计数边沿 */
    uint32_t countEdge;

    /* ETR触发计数边沿 */
    uint32_t triggerEdge;

} FL_LPTIM16_InitTypeDef;

/**
  * @brief  LPTIM16 Output Compare Configuration Structure Definition
  */
typedef struct
{
    uint32_t compareValue;

    uint32_t OCPolarity;

} FL_LPTIM16_OC_InitTypeDef;

/**
  * @brief  LPTIM16 Input Capture Configuration Structure Definition
  */
typedef struct
{
    uint32_t channel1Prescaler;

    uint32_t channel1CaptureSource;

    FL_FunState ICInputDigitalFilter;

    uint32_t ICInputPolarity;

    uint32_t ICEdge;

} FL_LPTIM16_IC_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup LPTIM16_FL_Exported_Constants LPTIM16 Exported Constants
  * @{
  */

#define    LPTIM16_CR_EN_Pos                                      (0U)
#define    LPTIM16_CR_EN_Msk                                      (0x1U << LPTIM16_CR_EN_Pos)
#define    LPTIM16_CR_EN                                          LPTIM16_CR_EN_Msk

#define    LPTIM16_CFGR_ETR_AFEN_Pos                              (24U)
#define    LPTIM16_CFGR_ETR_AFEN_Msk                              (0x1U << LPTIM16_CFGR_ETR_AFEN_Pos)
#define    LPTIM16_CFGR_ETR_AFEN                                  LPTIM16_CFGR_ETR_AFEN_Msk

#define    LPTIM16_CFGR_PSCSEL_Pos                                (14U)
#define    LPTIM16_CFGR_PSCSEL_Msk                                (0x1U << LPTIM16_CFGR_PSCSEL_Pos)
#define    LPTIM16_CFGR_PSCSEL                                    LPTIM16_CFGR_PSCSEL_Msk

#define    LPTIM16_CFGR_DIVSEL_Pos                                (10U)
#define    LPTIM16_CFGR_DIVSEL_Msk                                (0x7U << LPTIM16_CFGR_DIVSEL_Pos)
#define    LPTIM16_CFGR_DIVSEL                                    LPTIM16_CFGR_DIVSEL_Msk

#define    LPTIM16_CFGR_EDGESEL_Pos                               (7U)
#define    LPTIM16_CFGR_EDGESEL_Msk                               (0x1U << LPTIM16_CFGR_EDGESEL_Pos)
#define    LPTIM16_CFGR_EDGESEL                                   LPTIM16_CFGR_EDGESEL_Msk

#define    LPTIM16_CFGR_TRIGCFG_Pos                               (5U)
#define    LPTIM16_CFGR_TRIGCFG_Msk                               (0x3U << LPTIM16_CFGR_TRIGCFG_Pos)
#define    LPTIM16_CFGR_TRIGCFG                                   LPTIM16_CFGR_TRIGCFG_Msk

#define    LPTIM16_CFGR_QEMD_Pos                                  (3U)
#define    LPTIM16_CFGR_QEMD_Msk                                  (0x3U << LPTIM16_CFGR_QEMD_Pos)
#define    LPTIM16_CFGR_QEMD                                      LPTIM16_CFGR_QEMD_Msk

#define    LPTIM16_CFGR_MMS_Pos                                   (16U)
#define    LPTIM16_CFGR_MMS_Msk                                   (0x7U << LPTIM16_CFGR_MMS_Pos)
#define    LPTIM16_CFGR_MMS                                       LPTIM16_CFGR_MMS_Msk

#define    LPTIM16_CFGR_ONST_Pos                                  (2U)
#define    LPTIM16_CFGR_ONST_Msk                                  (0x1U << LPTIM16_CFGR_ONST_Pos)
#define    LPTIM16_CFGR_ONST                                      LPTIM16_CFGR_ONST_Msk

#define    LPTIM16_CFGR_TMODE_Pos                                 (0U)
#define    LPTIM16_CFGR_TMODE_Msk                                 (0x3U << LPTIM16_CFGR_TMODE_Pos)
#define    LPTIM16_CFGR_TMODE                                     LPTIM16_CFGR_TMODE_Msk

#define    LPTIM16_IER_CCIE_Pos                                   (0U)
#define    LPTIM16_IER_CCIE_Msk                                   (0x3U << LPTIM16_IER_CCIE_Pos)
#define    LPTIM16_IER_CCIE                                       LPTIM16_IER_CCIE_Msk

#define    LPTIM16_IER_OVIE_Pos                                   (6U)
#define    LPTIM16_IER_OVIE_Msk                                   (0x1U << LPTIM16_IER_OVIE_Pos)
#define    LPTIM16_IER_OVIE                                       LPTIM16_IER_OVIE_Msk

